---
kind: type
id: T:Autodesk.Revit.DB.InstanceNode
source: html/4f7fbd19-9a61-c173-2b4f-9c0be9e550bb.htm
---
# Autodesk.Revit.DB.InstanceNode

An output node that represents an instance of a geometry. It can be an instance of FamilyInstance, or it can be and instance of a part of symbol's geometry.

## Syntax (C#)
```csharp
public class InstanceNode : GroupNode
```

## Remarks
See also: OnInstanceBegin(InstanceNode) .
 The SymbolGeometryId . contains the data for comparing if two InstanceNode points to the same geometry.